Revit 2027 API
FreeFormElement.CanOffsetFace Method
 Determines if the input face of the FreeFormElement can be offset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanOffsetFace(
	Face face
)
Public Function CanOffsetFace (
	face As Face
) As Boolean
public:
bool CanOffsetFace(
	Face^ face
)
member CanOffsetFace :
        face : Face -> bool
Parameters
face Face
 The face to be checked.
Return Value
Boolean
 True if the face can be offset, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FreeFormElement Class
Autodesk.Revit.DB Namespace